In [1]:
import pandas as pd

s1 = pd.Series(['a','b'])
s2 = pd.Series(['c','d'])

In [3]:
s1

0    a
1    b
dtype: object

In [4]:
s2

0    c
1    d
dtype: object

In [28]:
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [48]:
data1 ={'Name':['praveen','sam','ruman'],
       'Age':[26,27,28]}
data2 ={'Name':['sita','geeta','ram'],
       'Age':[26,27,28]}
data3 ={'Name':['sita','geeta','ram'],
       'age':[26,27,28],
       'address':['UP','Delhi','Delhi']}

In [49]:
df1 = pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df3=pd.DataFrame(data3)

In [50]:
df1

      Name  Age
0  praveen   26
1      sam   27
2    ruman   28

In [51]:
df2

    Name  Age
0   sita   26
1  geeta   27
2    ram   28

In [52]:
pd.concat([df1,df2],sort=True)

   Age     Name
0   26  praveen
1   27      sam
2   28    ruman
0   26     sita
1   27    geeta
2   28      ram

In [8]:
df2

    Name  age
0   sita   26
1  geeta   27
2    ram   28

In [13]:
df3

    Name  age address
0   sita   26      UP
1  geeta   27   Delhi
2    ram   28   Delhi

In [18]:
df=pd.concat([df1,df3],keys=['s1','s2'])

In [19]:
df

         Name  age address
s1 0  praveen   26     NaN
   1      sam   27     NaN
   2    ruman   28     NaN
s2 0     sita   26      UP
   1    geeta   27   Delhi
   2      ram   28   Delhi

In [24]:
df.index

MultiIndex([('s1', 0),
            ('s1', 1),
            ('s1', 2),
            ('s2', 0),
            ('s2', 1),
            ('s2', 2)],
           )

In [25]:
df.loc[('s1', 0),'Name']

'praveen'